app/views/lists/index.html.haml

SELECT `categories`.* FROM `categories` ORDER BY `categories`.`id` ASC
---
              = f.label :category_id_eq, "項目：", class: "search__field__category__label"
              = f.collection_select :category_id_eq, Category.all.order(id: :ASC), :id, :name, prompt: "--", class: 'category__detail'
            .search__field__price