app/controllers/books_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 2 AND `books`.`select` = '収入' AND `books`.`date` BETWEEN '2020-05-31 15:00:00' AND '2020-06-30 14:59:59'
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 2
SELECT categories.name, SUM(books.price) FROM `books` LEFT OUTER JOIN `categories` ON `categories`.`id` = `books`.`category_id` WHERE `categories`.`id` BETWEEN 1 AND 15 AND `books`.`user_id` = 2 AND `books`.`date` BETWEEN '2020-05-31 15:00:00' AND '2020-06-30 14:59:59' GROUP BY categories.name ORDER BY SUM(books.price) DESC
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 2 ORDER BY `books`.`date` DESC, `books`.`updated_at` DESC LIMIT 5
---
  def index
    @month = Date.today.strftime('%-m月')
    @text = "の収支"
    @title = @month + @text

    # 収入計算
    @income =Book.where(user_id: current_user.id).where(select: "収入").where(date: Time.current.all_month)
		@income_total = 0
		@income.each do |income|
      @income_total += income.price
    end
    # 支出計算
    @expense =Book.where(user_id: current_user.id).where(select: "支出").where(date: Time.current.all_month)
    @expense_total = 0
    @expense.each do |expense|
      @expense_total += expense.price
    end
    # 収支計算
    @sum = @income_total - @expense_total

    # 円グラフ
    @expense_chart = Book.eager_load(:category).where(categories: {id: 1..15 }).where(user_id: current_user.id).where(date: Time.current.all_month).group('categories.name').order("SUM(books.price) DESC").pluck('categories.name, SUM(books.price)')
    @income_chart = Book.eager_load(:category).where(categories: {id: 16..23 }).where(user_id: current_user.id).where(date: Time.current.all_month).group('categories.name').order("SUM(books.price) DESC").pluck('categories.name, SUM(books.price)')

    #直近の明細
    @books = Book.where(user_id: current_user.id).order(date: :DESC, updated_at: :DESC).limit(5)