app/controllers/lists_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 2 ORDER BY `books`.`date` DESC, `books`.`updated_at` DESC LIMIT 10 OFFSET 0
---
  def index
    @books = current_user.books.order(date: :DESC, updated_at: :DESC).page(params[:page]).per(10) # userモデルにhas_many :booksとあるのでこう書ける