app/controllers/lists_controller.rb

SELECT `categories`.* FROM `categories` ORDER BY `categories`.`id` ASC
---
  def index
    @categories = Category.all