app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `books`.* FROM `books` INNER JOIN `bookmarks` ON `books`.`id` = `bookmarks`.`book_id` WHERE `bookmarks`.`user_id` = 2 ORDER BY `books`.`date` DESC, `books`.`updated_at` DESC LIMIT 10 OFFSET 0
---
  def show
    @user = User.find(params[:id])
    @books = @user.books
    @bookmark_books = @user.bookmark_books.order(date: :DESC, updated_at: :DESC).page(params[:page]).per(10)